#include "BitcoinExchange.hpp"

BitcoinExchange::BitcoinExchange(){}

BitcoinExchange::BitcoinExchange(const BitcoinExchange &obj)
{
    if (this != obj)
        *this = obj;

    return *this;
}

BitcoinExchange BitcoinExchange::operator=(const BitcoinExchange &rhs)
{
    if (this != &rhs)
        this->_file = rhs._file;

    return *this;
}

BitcoinExchange::~BitcoinExchange(){}




/*
1.сделать парсинг, то есть проверку на валидность данных, которые мы получаем из файла.
2.сделать проверку на валидность даты, то есть проверку на то, что дата в файле соответствует формату YYYY-MM-DD.
3.сделать проверку на валидность значения, то есть проверку на то, что значение в файле является числом и находится в допустимом диапазоне.
4.сделать проверку на наличие файла, то есть проверку на то, что файл существует и может быть открыт для чтения.
5.сделать обработку ошибок, то есть вывод сообщений об ошибках в случае возникновения проблем с файлом или данными.
6.сделать вывод результатов, то есть вывод информации о валидных данных из файла в консоль или в другой файл.
*/